Revit 2027 API
FailuresAccessor.GetFailureHandlingOptions Method
 Provides access to the failure handling options for the transaction currently being finished.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public FailureHandlingOptions GetFailureHandlingOptions()
Public Function GetFailureHandlingOptions As FailureHandlingOptions
public:
FailureHandlingOptions^ GetFailureHandlingOptions()
member GetFailureHandlingOptions : unit -> FailureHandlingOptions
Return Value
FailureHandlingOptions
 The failure handling options for transaction currently being finished.
Exceptions
Exception | Condition
InvalidOperationException |  This FailuresAccessor is inactive (is used outside of failures processing).
See Also
Reference
FailuresAccessor Class
Autodesk.Revit.DB Namespace